code-review/NRB_3471_3546/База_Было/Documents/УслугиДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УслугиДепозитария</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/УслугиДепозитария/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает заполненный табличный документ печатной формы (Акт, Счет)
//
// Параметры:
//  ДокументыДляПечати	 - Массив - Массив ссылок на документы УслугиДепозитария для печати
//  ВидПечатнойФормы			 - Строка - Вид печатной формы для печати ("Акт", "Счет")
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Заполненный табличный документ печатной формы
//
Функция Печать(ДокументыДляПечати, ВидПечатнойФормы) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляПечатиДокумента();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ДокументыДляПечати", ДокументыДляПечати);
	Запрос.УстановитьПараметр("ЮрАдресФизЛица", Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ЮрАдресЮрЛица", Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет(ВидПечатнойФормы);
	ВывестиРазделитель = Ложь;
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФорматДаты = "ДФ=dd.MM.yyyy";
	ФорматПериода = "ДФ='ММММ yyyy'";
	Пока ВыборкаДокумент.Следующий() Цикл
	
		Если ВывестиРазделитель Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ВывестиРазделитель = Истина;
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаДокумент);
		ОбластьШапка.Параметры.Дата = Формат(ВыборкаДокумент.Дата, ФорматДаты);
		Если ОбластьШапка.НайтиТекст("ДоговорДата") <> Неопределено Тогда
			ОбластьШапка.Параметры.ДоговорДата = Формат(ВыборкаДокумент.ДоговорДата, ФорматДаты);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Выборка = ВыборкаДокумент.Выбрать();
		СуммаКомиссииИтого = 0;
		НомерСтроки = 0;
		Пока Выборка.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка);
			ОбластьСтрокаТаблицы.Параметры.ДоговорДата = Формат(Выборка.ДоговорДата, ФорматДаты);
			ОбластьСтрокаТаблицы.Параметры.ПериодОбслуживания = Формат(Выборка.ПериодРасчетаКомиссии, ФорматПериода);
			Если ОбластьСтрокаТаблицы.НайтиТекст("НомерСтроки") <> Неопределено Тогда
				ОбластьСтрокаТаблицы.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧРГ=");
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			СуммаКомиссииИтого = СуммаКомиссииИтого + Выборка.СуммаКомиссии;
			
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаДокумент);
		Если ОбластьПодвал.НайтиТекст("ДоговорДата") <> Неопределено Тогда
			ОбластьПодвал.Параметры.ДоговорДата = Формат(ВыборкаДокумент.ДоговорДата, ФорматДаты);
		КонецЕсли;
		ОбластьПодвал.Параметры.СуммаКомиссииИтого = СуммаКомиссииИтого;
		СуммаКомиссииИтогоПрописью = ЧислоПрописью(СуммаКомиссииИтого, "ДП = Истина", ВыборкаДокумент.ВалютаПараметрыПрописиНаРусском);
		ОбластьПодвал.Параметры.СуммаКомиссииИтогоПрописью = СуммаКомиссииИтогоПрописью;
		ДанныеФизическогоЛица =
			ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), ВыборкаДокумент.ФизическоеЛицоПользователя, ТекущаяДата);
		ОбластьПодвал.Параметры.ФИО = ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(ДанныеФизическогоЛица.Фамилия,
			ДанныеФизическогоЛица.Имя, ДанныеФизическогоЛица.Отчество);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДляПечатиДокумента()
	
	Возврат
	"ВЫБРАТЬ
	|	УслугиДепозитария.Ссылка КАК Документ,
	|	УслугиДепозитария.Номер КАК Номер,
	|	УслугиДепозитария.Дата КАК Дата,
	|	УслугиДепозитария.ПериодРасчетаКомиссии КАК ПериодРасчетаКомиссии,
	|	УслугиДепозитария.Контрагент КАК Контрагент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.СчетСписанияКомиссииВНРБанке КАК СчетПолучателя,
	|	ДоговорыКонтрагентов.Наименование КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ДатаНачалоДействия КАК ДоговорДата,
	|	УслугиДепозитарияУслуги.Услуга.Наименование КАК УслугаНаименование,
	|	УслугиДепозитарияУслуги.СуммаКомиссии КАК СуммаКомиссии,
	|	ВЫРАЗИТЬ(УслугиДепозитарияУслуги.Валюта.ПараметрыПрописиНаРусском КАК СТРОКА(100)) КАК ВалютаПараметрыПрописиНаРусском
	|ПОМЕСТИТЬ УслугиДепозитария
	|ИЗ
	|	Документ.УслугиДепозитария.Услуги КАК УслугиДепозитарияУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УслугиДепозитария КАК УслугиДепозитария
	|		ПО УслугиДепозитарияУслуги.Ссылка = УслугиДепозитария.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (УслугиДепозитария.Контрагент = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (УслугиДепозитария.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	УслугиДепозитария.Ссылка В(&ДокументыДляПечати)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизЛиц.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ ФИОФизЛиц
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ТекущаяДата,
	|			ФизЛицо В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УслугиДепозитария.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|				ИЗ
	|					УслугиДепозитария КАК УслугиДепозитария)) КАК ФИОФизЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаЮрЛиц.Объект КАК Объект,
	|	АдресаЮрЛиц.Представление КАК Представление
	|ПОМЕСТИТЬ АдресаЮрЛиц
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Вид = &ЮрАдресЮрЛица
	|				И Тип = &Адрес
	|				И Объект В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						УслугиДепозитария.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|					ИЗ
	|						УслугиДепозитария КАК УслугиДепозитария)) КАК АдресаЮрЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаФизЛиц.Объект КАК Объект,
	|	АдресаФизЛиц.Представление КАК Представление
	|ПОМЕСТИТЬ АдресаФизЛиц
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Вид = &ЮрАдресФизЛица
	|				И Тип = &Адрес
	|				И Объект В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						УслугиДепозитария.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|					ИЗ
	|						УслугиДепозитария КАК УслугиДепозитария)) КАК АдресаФизЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДепозитария.Документ КАК Документ,
	|	УслугиДепозитария.Номер КАК Номер,
	|	УслугиДепозитария.Дата КАК Дата,
	|	УслугиДепозитария.ПериодРасчетаКомиссии КАК ПериодРасчетаКомиссии,
	|	ВЫБОР
	|		КОГДА УслугиДепозитария.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛиц.Фамилия, """") + "" "" + ЕСТЬNULL(ФИОФизЛиц.Имя, """") + "" "" + ЕСТЬNULL(ФИОФизЛиц.Отчество, """")
	|		КОГДА УслугиДепозитария.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА УслугиДепозитария.ЮридическиеФизическиеЛица.Наименование
	|	КОНЕЦ КАК Кому,
	|	ВЫБОР
	|		КОГДА УслугиДепозитария.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(АдресаФизЛиц.Представление, """")
	|		КОГДА УслугиДепозитария.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(АдресаЮрЛиц.Представление, """")
	|	КОНЕЦ КАК Адрес,
	|	УслугиДепозитария.ИНН КАК ИНН,
	|	УслугиДепозитария.СчетПолучателя КАК СчетПолучателя,
	|	УслугиДепозитария.ДоговорНомер КАК ДоговорНомер,
	|	УслугиДепозитария.ДоговорДата КАК ДоговорДата,
	|	УслугиДепозитария.УслугаНаименование КАК УслугаНаименование,
	|	УслугиДепозитария.СуммаКомиссии КАК СуммаКомиссии,
	|	УслугиДепозитария.ВалютаПараметрыПрописиНаРусском КАК ВалютаПараметрыПрописиНаРусском,
	|	ВЫРАЗИТЬ(&ТекущийПользователь КАК Справочник.Пользователи).ФизЛицо КАК ФизическоеЛицоПользователя
	|ИЗ
	|	УслугиДепозитария КАК УслугиДепозитария
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИОФизЛиц КАК ФИОФизЛиц
	|		ПО УслугиДепозитария.ЮридическиеФизическиеЛица = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаЮрЛиц КАК АдресаЮрЛиц
	|		ПО УслугиДепозитария.ЮридическиеФизическиеЛица = АдресаЮрЛиц.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаФизЛиц КАК АдресаФизЛиц
	|		ПО УслугиДепозитария.ЮридическиеФизическиеЛица = АдресаФизЛиц.Объект
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Кому),
	|	МАКСИМУМ(Адрес),
	|	МАКСИМУМ(ИНН),
	|	МАКСИМУМ(СчетПолучателя),
	|	МАКСИМУМ(ДоговорНомер),
	|	МАКСИМУМ(ДоговорДата),
	|	МАКСИМУМ(ВалютаПараметрыПрописиНаРусском),
	|	МАКСИМУМ(ФизическоеЛицоПользователя)
	|ПО
	|	Документ";
	
КонецФункции

#КонецОбласти
